## Staging: lambda-api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 4 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_appautoscaling_scheduled_action.api-5pm will be created
  + resource "aws_appautoscaling_scheduled_action" "api-5pm" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "api-5pm"
      + resource_id        = (known after apply)
      + scalable_dimension = "lambda:function:ProvisionedConcurrency"
      + schedule           = "cron(0 17 * * ? *)"
      + service_namespace  = "lambda"
      + timezone           = "America/Toronto"

      + scalable_target_action {
          + max_capacity = "5"
          + min_capacity = "1"
        }
    }

  # aws_appautoscaling_scheduled_action.api-noon will be created
  + resource "aws_appautoscaling_scheduled_action" "api-noon" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "api-noon"
      + resource_id        = (known after apply)
      + scalable_dimension = "lambda:function:ProvisionedConcurrency"
      + schedule           = "cron(0 12 * * ? *)"
      + service_namespace  = "lambda"
      + timezone           = "America/Toronto"

      + scalable_target_action {
          + max_capacity = "10"
          + min_capacity = "1"
        }
    }

  # aws_appautoscaling_target.api will be created
  + resource "aws_appautoscaling_target" "api" {
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 1
      + resource_id        = (known after apply)
      + role_arn           = (known after apply)
      + scalable_dimension = "lambda:function:ProvisionedConcurrency"
      + service_namespace  = "lambda"
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "api-lambda"
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:15" -> (known after apply)
        tags                           = {}
      ~ version                        = "15" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = (sensitive)
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_provisioned_concurrency_config.api will be created
  + resource "aws_lambda_provisioned_concurrency_config" "api" {
      + function_name                     = "api-lambda"
      + id                                = (known after apply)
      + provisioned_concurrent_executions = 1
      + qualifier                         = (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-api-lambda-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api-lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.ecr-user-access-key"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_lambda"]

33 tests, 16 passed, 17 warnings, 0 failures, 0 exceptions

```

</details>
